hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/ble_services/ble_ancs_c/nrf_ble_ancs_c.h
/**
    Copyright (c) 2012 - 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/
/** @file

    @defgroup ble_ancs_c Apple Notification Service client
    @{
    @ingroup ble_sdk_srv

    @brief Apple Notification Center Service Client Module.

    @details Disclaimer: This client implementation of the Apple Notification Center Service can
            be changed at any time by Nordic Semiconductor ASA. Server implementations such as the
            ones found in iOS can be changed at any time by Apple and may cause this client
            implementation to stop working.

    This module implements the Apple Notification Center Service (ANCS) client.
    This client can be used as a Notification Consumer (NC) that receives data
    notifications from a Notification Provider (NP). The NP is typically an iOS
    device acting as a server. For terminology and up-to-date specs, see
    http://developer.apple.com.

    The term "notification" is used in two different meanings:
    - An <i>iOS notification</i> is the data received from the Notification Provider.
    - A <i>GATTC notification</i> is a way to transfer data with <i>Bluetooth</i> Smart.
    In this module, we receive iOS notifications using GATTC notifications.
    We use the full term (iOS notification or GATTC notification) where required to avoid confusion.

    Upon initializing the module, you must add the different iOS notification attributes you
    would like to receive for iOS notifications (see @ref nrf_ble_ancs_c_attr_add).

    Once a connection is established with a central device, the module does a service discovery to
    discover the ANCS server handles. If this succeeds (@ref BLE_ANCS_C_EVT_DISCOVERY_COMPLETE),
    the handles for the ANCS server are part of the @ref ble_ancs_c_evt_t structure and must be
    assigned to an ANCS_C instance using the @ref nrf_ble_ancs_c_handles_assign function. For more
    information about service discovery, see the @ref lib_ble_db_discovery documentation.

    The application can now subscribe to iOS notifications using
    @ref ble_ancs_c_notif_source_notif_enable. They arrive in the @ref BLE_ANCS_C_EVT_NOTIF event.
    @ref nrf_ble_ancs_c_request_attrs can be used to request attributes for the notifications. They
    arrive in the @ref BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE event.
    @ref nrf_ble_ancs_c_app_attr_request can be used to request attributes of the app that issued
    the notifications. They arrive in the @ref BLE_ANCS_C_EVT_APP_ATTRIBUTE event.
    @ref nrf_ancs_perform_notif_action can be used to make the Notification Provider perform an
    action based on the provided notification.

    @msc
    hscale = "1.5";
    Application, ANCS_C;
    |||;
    Application=>ANCS_C   [label = "ble_ancs_c_attr_add(attribute)"];
    Application=>ANCS_C   [label = "ble_ancs_c_init(ancs_instance, event_handler)"];
    ...;
    Application<<=ANCS_C  [label = "BLE_ANCS_C_EVT_DISCOVERY_COMPLETE"];
    Application=>ANCS_C   [label = "ble_ancs_c_handles_assign(ancs_instance, conn_handle, service_handles)"];
    Application=>ANCS_C   [label = "ble_ancs_c_notif_source_notif_enable(ancs_instance)"];
    Application=>ANCS_C   [label = "ble_ancs_c_data_source_notif_enable(ancs_instance)"];
    |||;
    ...;
    |||;
    Application<<=ANCS_C  [label = "BLE_ANCS_C_EVT_NOTIF"];
    |||;
    ...;
    |||;
    Application=>ANCS_C   [label = "ble_ancs_c_request_attrs(attr_id, buffer)"];
    Application<<=ANCS_C  [label = "BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE"];
    |||;
    @endmsc

    @note    The application must register this module as BLE event observer using the
            NRF_SDH_BLE_OBSERVER macro. Example:
            @code
                ble_ancs_c_t instance;
                NRF_SDH_BLE_OBSERVER(anything, BLE_ANCS_C_BLE_OBSERVER_PRIO,
                                     ble_ancs_c_on_ble_evt, &instance);
            @endcode
*/
#ifndef BLE_ANCS_C_H__
#define BLE_ANCS_C_H__

#include "ble_types.h"
#include "ble_srv_common.h"
#include "sdk_errors.h"
#include "ble_db_discovery.h"
#include "nrf_sdh_ble.h"

#ifdef __cplusplus
extern "C" {
#endif

/** @brief   Macro for defining a ble_ancs_c instance.

