hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/ble_services/ble_ancs_c/nrf_ble_ancs_c.h
/**@brief iOS notification structure, which contains various status information for the client. */
typedef struct
{
    ble_ancs_c_evt_handler_t evt_handler;                                     //!< Event handler to be called for handling events in the Apple Notification client application.
    ble_srv_error_handler_t  error_handler;                                   //!< Function to be called in case of an error.
    uint16_t                 conn_handle;                                     //!< Handle of the current connection. Set with @ref nrf_ble_ancs_c_handles_assign when connected.
    ble_ancs_c_service_t     service;                                         //!< Structure to store the different handles and UUIDs related to the service.
    ble_ancs_c_attr_list_t
    ancs_notif_attr_list[BLE_ANCS_NB_OF_NOTIF_ATTR]; //!< For all attributes; contains whether they should be requested upon attribute request and the length and buffer of where to store attribute data.
    ble_ancs_c_attr_list_t
    ancs_app_attr_list[BLE_ANCS_NB_OF_APP_ATTR];     //!< For all app attributes; contains whether they should be requested upon attribute request and the length and buffer of where to store attribute data.
    uint32_t                 number_of_requested_attr;                        //!< The number of attributes that will be requested when an iOS notification attribute request is made.
    ble_ancs_parse_sm_t      parse_info;                                      //!< Structure containing different information used to parse incoming attributes (from data_source characteristic) correctly.
    ble_ancs_c_evt_t
    evt;                                             //!< The event is filled with several iterations of the @ref ancs_parse_get_attrs_response function when requesting iOS notification attributes. So we must allocate memory for it here.
} ble_ancs_c_t;

/** @brief Apple Notification client init structure, which contains all options and data needed for
          initialization of the client. */
typedef struct
{
    ble_ancs_c_evt_handler_t evt_handler;    //!< Event handler to be called for handling events in the Battery Service.
    ble_srv_error_handler_t  error_handler;  //!< Function to be called in case of an error.
} ble_ancs_c_init_t;


/**@brief Apple Notification Center Service UUIDs. */
extern const ble_uuid128_t ble_ancs_base_uuid128;     //!< Service UUID.
extern const ble_uuid128_t ble_ancs_cp_base_uuid128;  //!< Control point UUID.
extern const ble_uuid128_t ble_ancs_ns_base_uuid128;  //!< Notification source UUID.
extern const ble_uuid128_t ble_ancs_ds_base_uuid128;  //!< Data source UUID.


/** @brief Function for handling the application's BLE stack events.

    @details Handles all events from the BLE stack that are of interest to the ANCS client.

    @param[in] p_ble_evt  Event received from the BLE stack.
    @param[in] p_context     ANCS client structure.
*/
void ble_ancs_c_on_ble_evt(ble_evt_t const *p_ble_evt, void *p_context);


/** @brief     Function for handling events from the database discovery module.

    @details   This function will handle an event from the database discovery module and determine
              if it relates to the discovery of ANCS at the peer. If so, it will
              call the application's event handler indicating that ANCS has been
              discovered at the peer. It also populates the event with the service related
              information before providing it to the application.

    @param[in] p_ancs Pointer to the ANCS client structure.
    @param[in] p_evt  Pointer to the event received from the database discovery module.
*/
void ble_ancs_c_on_db_disc_evt(ble_ancs_c_t *p_ancs, ble_db_discovery_evt_t *p_evt);


/** @brief Function for initializing the ANCS client.

    @param[out] p_ancs       ANCS client structure. This structure must be
                            supplied by the application. It is initialized by this function
                            and will later be used to identify this particular client instance.
    @param[in]  p_ancs_init  Information needed to initialize the client.

    @retval NRF_SUCCESS  If the client was initialized successfully. Otherwise, an error code is returned.
*/
ret_code_t ble_ancs_c_init(ble_ancs_c_t *p_ancs, ble_ancs_c_init_t const *p_ancs_init);


/** @brief Function for writing to the CCCD to enable notifications from the Apple Notification Service.

    @param[in] p_ancs  iOS notification structure. This structure must be supplied by
                      the application. It identifies the particular client instance to use.

    @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
*/
ret_code_t ble_ancs_c_notif_source_notif_enable(ble_ancs_c_t const *p_ancs);


/** @brief Function for writing to the CCCD to enable data source notifications from the ANCS.

    @param[in] p_ancs iOS notification structure. This structure must be supplied by
                     the application. It identifies the particular client instance to use.

    @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
*/
ret_code_t ble_ancs_c_data_source_notif_enable(ble_ancs_c_t const *p_ancs);


/** @brief Function for writing to the CCCD to disable notifications from the ANCS.

    @param[in] p_ancs  iOS notification structure. This structure must be supplied by
                      the application. It identifies the particular client instance to use.

    @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
*/
ret_code_t ble_ancs_c_notif_source_notif_disable(ble_ancs_c_t const *p_ancs);


/** @brief Function for writing to the CCCD to disable data source notifications from the ANCS.

    @param[in] p_ancs  iOS notification structure. This structure must be supplied by
                      the application. It identifies the particular client instance to use.

    @retval NRF_SUCCESS If writing to the CCCD was successful. Otherwise, an error code is returned.
*/
ret_code_t ble_ancs_c_data_source_notif_disable(ble_ancs_c_t const *p_ancs);


