hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/ble_services/ble_ancs_c/nrf_ble_ancs_c.h
/** @brief Function for registering attributes that will be requested when @ref nrf_ble_ancs_c_request_attrs
          is called.

    @param[in] p_ancs ANCS client instance on which the attribute will be registered.
    @param[in] id     ID of the attribute that will be added.
    @param[in] p_data Pointer to a buffer where the data of the attribute can be stored.
    @param[in] len    Length of the buffer where the data of the attribute can be stored.

    @retval NRF_SUCCESS If all operations were successful. Otherwise, an error code is returned.
*/
ret_code_t nrf_ble_ancs_c_attr_add(ble_ancs_c_t                        *p_ancs,
                                   ble_ancs_c_notif_attr_id_val_t const id,
                                   uint8_t                             *p_data,
                                   uint16_t const                       len);
                                   
                                   
/** @brief Function for removing attributes so that they will no longer be requested when
          @ref nrf_ble_ancs_c_request_attrs is called.

    @param[in] p_ancs ANCS client instance on which the attribute will be removed.
    @param[in] id     ID of the attribute that will be removed.

    @retval NRF_SUCCESS If all operations were successful. Otherwise, an error code is returned.
*/
ret_code_t nrf_ble_ancs_c_attr_remove(ble_ancs_c_t                        *p_ancs,
                                      ble_ancs_c_notif_attr_id_val_t const id);
                                      
/** @brief Function for removing attributes so that they will no longer be requested when
          @ref nrf_ble_ancs_c_app_attr_request is called.

    @param[in] p_ancs ANCS client instance on which the attribute will be removed.
    @param[in] id     ID of the attribute that will be removed.

    @retval NRF_SUCCESS If all operations were successful. Otherwise, an error code is returned.
*/
ret_code_t nrf_ble_ancs_c_app_attr_remove(ble_ancs_c_t                      *p_ancs,
                                          ble_ancs_c_app_attr_id_val_t const id);
                                          
                                          
/** @brief Function for registering attributes that will be requested when @ref nrf_ble_ancs_c_app_attr_request
          is called.

    @param[in] p_ancs ANCS client instance on which the attribute will be registered.
    @param[in] id     ID of the attribute that will be added.
    @param[in] p_data Pointer to a buffer where the data of the attribute can be stored.
    @param[in] len    Length of the buffer where the data of the attribute can be stored.

    @retval NRF_SUCCESS If all operations were successful. Otherwise, an error code is returned.
*/
ret_code_t nrf_ble_ancs_c_app_attr_add(ble_ancs_c_t                      *p_ancs,
                                       ble_ancs_c_app_attr_id_val_t const id,
                                       uint8_t                           *p_data,
                                       uint16_t const                     len);
                                       
/** @brief Function for clearing the list of notification attributes and app attributes that
          would be requested from NP.

    @param[in] p_ancs   iOS notification structure. This structure must be supplied by
                       the application. It identifies the particular client instance to use.
**/
ret_code_t nrf_ble_ancs_c_attr_req_clear_all(ble_ancs_c_t *p_ancs);

/** @brief Function for requesting attributes for a notification.

    @param[in] p_ancs   iOS notification structure. This structure must be supplied by
                       the application. It identifies the particular client instance to use.
    @param[in] p_notif  Pointer to the notification whose attributes will be requested from
                       the Notification Provider.

    @retval NRF_SUCCESS If all operations were successful. Otherwise, an error code is returned.
*/
ret_code_t nrf_ble_ancs_c_request_attrs(ble_ancs_c_t                  *p_ancs,
                                        ble_ancs_c_evt_notif_t const *p_notif);
                                        
/** @brief Function for requesting attributes for a given app.

    @param[in] p_ancs   iOS notification structure. This structure must be supplied by
                       the application. It identifies the particular client instance to use.
    @param[in] p_app_id App identifier of the app for which the app attributes are requested.
    @param[in] len      Length of the app identifier.

    @retval NRF_SUCCESS If all operations were successful. Otherwise, an error code is returned.
*/
ret_code_t nrf_ble_ancs_c_app_attr_request(ble_ancs_c_t   *p_ancs,
                                           uint8_t const *p_app_id,
                                           uint32_t        len);
                                           
                                           
/** @brief Function for performing a notification action.

    @param[in] p_ancs    iOS notification structure. This structure must be supplied by
                        the application. It identifies the particular client instance to use.
    @param[in] uuid      The UUID of the notification for which to perform the action.
    @param[in] action_id Perform a positive or negative action.

    @retval    NRF_SUCCESS    If the operation was successful.
    @retval    NRF_ERROR_NULL If @p p_ancs was a NULL pointer.
*/
ret_code_t nrf_ancs_perform_notif_action(ble_ancs_c_t *p_ancs,
                                         uint32_t uuid,
                                         ble_ancs_c_action_id_values_t action_id);
                                         
/** @brief Function for assigning a handle to this instance of ancs_c.

    @details Call this function when a link has been established with a peer to
            associate this link to this instance of the module. This makes it
            possible to handle several link and associate each link to a particular
            instance of this module. The connection handle and attribute handles will be
            provided from the discovery event @ref BLE_ANCS_C_EVT_DISCOVERY_COMPLETE.

    @param[in] p_ancs      Pointer to the ANCS client structure instance to associate with these
                          handles.
    @param[in] conn_handle Connection handle to associate with the given ANCS instance.
    @param[in] p_service   Attribute handles on the ANCS server that you want this ANCS client to
                          interact with.

    @retval    NRF_SUCCESS    If the operation was successful.
    @retval    NRF_ERROR_NULL If @p p_ancs was a NULL pointer.
*/
ret_code_t nrf_ble_ancs_c_handles_assign(ble_ancs_c_t                *p_ancs,
                                         uint16_t const               conn_handle,
                                         ble_ancs_c_service_t const *p_service);
                                         
#ifdef __cplusplus
}
#endif

#endif // BLE_ANCS_C_H__

/** @} */

